app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # @friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "Human"], ["email", "Meg@thehuman.com"], ["phone", "111 222 3333"], ["twitter", "@thehuman"], ["updated_at", "2022-05-14 09:06:18.746023"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)